{"theme":{"wrap":{"zIndex":9999999999},"overlay":{"zIndex":99999},"banner":{"backgroundColor":"#ffffff","color":"#000000"},"button":{"borderRadius":4},"primaryButton":{"backgroundColor":"#048747","color":"#ffffff"},"footer":{"backgroundColor":"#048747","color":"#ffffff"},"secondaryButton":{"backgroundColor":"#ffffff","color":"#000000"},"doNotSellButton":{"fontSize":"","fontWeight":"bold"},"showPoweredBy":true,"assets":{"floaterSrc":"https://cdn.complyauto.com/cookiebanner/assets/Floater_Icon.svg","doNotSellSrc":"https://cdn.complyauto.com/cookiebanner/assets/Floater_Icon.svg"},"addFooterPadding":false},"links":{"disclosure":"https://www.supercarguys.com/privacy-policy/","optOut":"https://www.supercarguys.com/privacy-requests/"},"policy":{"consentMethod":"OPT_IN","showDoNotSellButton":false,"disableAutoBlock":false,"disableBanner":false,"hasCloseButton":true,"hasFooter":false},"collection":{"hasThirdPartyCookies":true,"isSelling":true},"floater":{"isEnabled":true,"position":"bottomLeft","size":"large"},"text":{"banner":{"header":"WE VALUE YOUR PRIVACY","primary":"We respect consumer privacy rights by letting visitors opt out of third-party tracking cookies and honoring user-enabled global privacy controls, like the GPC signal. This site deploys cookies and similar tracking technologies to build profiles, serve ads, and personalize your experience across websites. By pressing accept, you consent to the use of such cookies. To manage your privacy rights or view the categories of personal information we collect and the purposes for which the information is used, ","secondary":"","disclosuresLinkText":"click here","doNotSellLinkText":"Do Not Sell My Personal Information","gpcHeader":"Opt-Out Preference Signal Honored","gpcDescription":"Due to our website detecting your use of the Global Privacy Control, you have been automatically opted out of third-party tracking cookies and the sale and sharing of your information for targeted advertising.","gpcPrivacyPolicy":"To manage your privacy rights or view the categories of personal information we collect and the purposes for which the information is used, ","gpcDoNotSell":" "},"primaryButton":{"body":"Accept and Continue ➞"},"secondaryButton":{"body":"Privacy Policy"},"poweredBy":{"body":"Powered by"},"modal":{"header":"Privacy Settings","sections":{"cookies":{"header":"Third-party Cookie Settings","description":"At any point, you can switch your “Third Party Cookies” settings below to prevent this website’s use of certain third-party cookies that track or advertise to you across other websites.","gpcDisabledText":"Third-party cookies cannot be turned on because we've detected that you're using a browser, device, or plug-in that has Global Privacy Control (GPC) enabled.","thirdPartyCookieText":"Third-Party Cookies"},"globalPrivacyControl":{"header":"Global Privacy Control","description":"We currently support Global Privacy Control (GPC), a specification designed to allow internet users to notify businesses of their privacy preferences, such as whether or not they want to be tracked or have their personal information sold or shared with third parties for targeted advertising. It consists of a setting or extension in the user’s browser or mobile device and acts as a mechanism that our websites can use to honor your privacy settings. If your browser or device has enabled GPC, it will override your preferences selected in the cookie banner or privacy settings on this Site. If you want to use GPC, you can download and enable it via a participating browser or browser extension. ","linkText":"Click here to view the increasing list of browsers and browser extensions that GPC is available for","useGpcDescription":"","deviceGpcDescription":""},"doNotSell":{"header":"Do Not Sell My Personal Information","description":"While we do not sell personal information for monetary value, we may disclose personal information to third parties, such as vehicle manufacturers, in such a way that may be considered a “sale” of personal information under the law. ","linkText":"To direct us to stop the sale of your personal information by submitting a request using our interactive web form, click here"},"noticeAtCollection":{"header":"Privacy Requests","description":"","linkText":"Click here to manage your privacy rights or view the categories of personal information we collect and the purposes for which the information is used"},"webChoices":{"header":"Web Choices","description":"Note that this site's cookie banner and privacy settings will only opt you out of the future tracking and sharing by cookies that are deployed by our Sites. In order to manage the information sharing and advertising cookies not deployed by our Sites (e.g., other third-party companies' cookies that are already tracking you), you may want to consider using one of the consumer choice tools created under self-regulation programs, such as the ","linkUrl":"https://optout.aboutads.info/?c=2&lang=EN","linkText":"Digital Advertising Alliance's WebChoices consumer choice tool"}},"closeButton":{"body":"Close"},"privacyPolicyLink":{"body":"Privacy Policy"},"toggleOptions":{"true":"On","false":"Off"}}}}